{"version":"0.4","title":"get started","type":"page","content":[{"id":"1d49108f","settings":[],"elements":[{"id":"7ad5de5f","settings":{"_column_size":100,"_inline_size":null},"elements":[{"id":"4ca92e2a","settings":{"editor":"<h1 class=\"title-2 xs-mb-30\" style=\"outline-style: none; outline-width: initial; box-sizing: inherit; margin-bottom: 30px; text-size-adjust: 100%; -webkit-font-smoothing: antialiased; font-family: gt-bold; font-weight: 600; line-height: 1.28; font-size: 44px; max-width: 41.125rem; color: #000000; font-style: normal;\">Get Started with Competitive Programming<\/h1><h4> <\/h4><h4>Pick a suitable programming language<\/h4><p>You can do competitive programming in any programming language – C\/C++, Java, and Python are highly recommended. Learn about all the syntaxes, built-in functions, templates, snippets, and library functions such as STL in C++, Big Integers in Java, etc. Working with the fundamentals will bring long term benefit to any individual.<\/p><h4>Choose a powerful code editor<\/h4><p>You will be working to solve many problems. To increase the speed and efficiency of your work, it is recommended that you write your code in a code editor. VS Code, Sublime Text 3, Pharm &amp; Vim are some of the popular editors where you can use their cool features and practice your craft. Use STL, snippets, and templates whenever you can; it not only saves your code length but also decreases the time to write your code. Now you can focus mainly on solving the actual logic of the problems.<\/p><h4>Learn basic data structures and algorithm concepts<\/h4><p>Nearly every coding problem will require the use of a specific data structure or algorithm for an optimal solution. Knowing basic data structures and algorithmic techniques before you start is a must; data structures and algorithms help make programs more efficient. Having a good amount of knowledge in DSA will help you in selecting the optimal data structure for any problem and implementing it with the most optimal logic.<\/p><p><a style=\"font-family: var( --e-global-typography-text-font-family ), Sans-serif; font-weight: var( --e-global-typography-text-font-weight ); background-color: #ffffff; font-size: 1rem;\" href=\"https:\/\/www.geeksforgeeks.org\/\" target=\"_blank\" rel=\"noopener\">Geeksforgeeks<\/a> is a great one-stop destination for data structures and algorithm concepts. It has a wide variety of articles on various data structures &amp; trivial and non-trivial algorithms.<\/p><h4>Solving different problems<\/h4><p>Repeatedly solving similar problems is not going to benefit you in the long run. It will keep you in the wrong bubble. Instead, start solving sufficiently different problems until you master that concept diligently and then jump to another one. Also, it can sometimes help to try to solve the problem initially by hand with pen and paper. This will give you the right foundation and proper roadmap to deliver optimized and bug-free code.<\/p>","text_color":"#0A8D36","_background_background":"classic","_background_color_stop":{"unit":"%","size":30,"sizes":[]},"_background_color_b_stop":{"unit":"%","size":84,"sizes":[]}},"elements":[],"isInner":false,"widgetType":"text-editor","elType":"widget"}],"isInner":false,"elType":"column"}],"isInner":false,"elType":"section"}],"page_settings":{"hide_title":"yes"}}